import numpy as np
import pandas as pd

#### Question 1

In [3]:
df=pd.read_csv("IPL_13.csv")

### Question 2

In [7]:
df.head()

,Sl.NO.,PLAYER NAME,AGE,COUNTRY,TEAM,PLAYING ROLE,T-RUNS,T-WKTS,ODI-RUNS-S,ODI-SR-B,...,SR-B,SIXERS,RUNS-C,WKTS,AVE-BL,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
0,1,"Abdulla, YA",2,SA,KXIP,Allrounder,0,0,0,0.00,...,0.00,0,307,15,20.47,8.90,13.93,2009,50000,50000
1,2,Abdur Razzak,2,BAN,RCB,Bowler,214,18,657,71.41,...,0.00,0,29,0,0.00,14.50,0.00,2008,50000,50000
2,3,"Agarkar, AB",2,IND,KKR,Bowler,571,58,1269,80.62,...,121.01,5,1059,29,36.52,8.81,24.90,2008,200000,350000
3,4,"Ashwin, R",1,IND,CSK,Bowler,284,31,241,84.56,...,76.32,0,1125,49,22.96,6.23,22.14,2011,100000,850000
4,5,"Badrinath, S",2,IND,CSK,Batsman,63,0,79,45.93,...,120.71,28,0,0,0.00,0.00,0.00,2011,100000,800000

### Question 3

In [12]:
metadata={
    'Shape': df.shape,
    'Columns': df.columns.tolist(),
    'Data Types': df.dtypes.to_dict(),
    'Number of Missing Values': df.isnull().sum().to_dict(),
    'Memory Usage': df.memory_usage(deep=True).sum()
}

In [16]:
for key, value in metadata.items():
    print(f"{key} : {value}")

Shape : (130, 26)
Columns : ['Sl.NO.', 'PLAYER NAME', 'AGE', 'COUNTRY', 'TEAM', 'PLAYING ROLE', 'T-RUNS', 'T-WKTS', 'ODI-RUNS-S', 'ODI-SR-B', 'ODI-WKTS', 'ODI-SR-BL', 'CAPTAINCY EXP', 'RUNS-S', 'HS', 'AVE', 'SR-B', 'SIXERS', 'RUNS-C', 'WKTS', 'AVE-BL', 'ECON', 'SR-BL', 'AUCTION YEAR', 'BASE PRICE', 'SOLD PRICE']
Data Types : {'Sl.NO.': dtype('int64'), 'PLAYER NAME': dtype('O'), 'AGE': dtype('int64'), 'COUNTRY': dtype('O'), 'TEAM': dtype('O'), 'PLAYING ROLE': dtype('O'), 'T-RUNS': dtype('int64'), 'T-WKTS': dtype('int64'), 'ODI-RUNS-S': dtype('int64'), 'ODI-SR-B': dtype('float64'), 'ODI-WKTS': dtype('int64'), 'ODI-SR-BL': dtype('float64'), 'CAPTAINCY EXP': dtype('int64'), 'RUNS-S': dtype('int64'), 'HS': dtype('int64'), 'AVE': dtype('float64'), 'SR-B': dtype('float64'), 'SIXERS': dtype('int64'), 'RUNS-C': dtype('int64'), 'WKTS': dtype('int64'), 'AVE-BL': dtype('float64'), 'ECON': dtype('float64'), 'SR-BL': dtype('float64'), 'AUCTION YEAR': dtype('int64'), 'BASE PRICE': dtype('int64'), 'SOLD PRICE': dtype('int64')}
Number of Missing Values : {'Sl.NO.': 0, 'PLAYER NAME': 0, 'AGE': 0, 'COUNTRY': 0, 'TEAM': 0, 'PLAYING ROLE': 0, 'T-RUNS': 0, 'T-WKTS': 0, 'ODI-RUNS-S': 0, 'ODI-SR-B': 0, 'ODI-WKTS': 0, 'ODI-SR-BL': 0, 'CAPTAINCY EXP': 0, 'RUNS-S': 0, 'HS': 0, 'AVE': 0, 'SR-B': 0, 'SIXERS': 0, 'RUNS-C': 0, 'WKTS': 0, 'AVE-BL': 0, 'ECON': 0, 'SR-BL': 0, 'AUCTION YEAR': 0, 'BASE PRICE': 0, 'SOLD PRICE': 0}
Memory Usage : 51626

### Question 4

In [21]:
df.describe()

,Sl.NO.,AGE,T-RUNS,T-WKTS,ODI-RUNS-S,ODI-SR-B,ODI-WKTS,ODI-SR-BL,CAPTAINCY EXP,RUNS-S,...,SR-B,SIXERS,RUNS-C,WKTS,AVE-BL,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
count,130.000000,130.000000,130.000000,130.000000,130.000000,130.000000,130.000000,130.000000,130.000000,130.000000,...,130.000000,130.000000,130.000000,130.000000,130.000000,130.000000,130.000000,130.000000,1.300000e+02,1.300000e+02
mean,65.500000,2.092308,2166.715385,66.530769,2508.738462,71.164385,76.076923,34.033846,0.315385,514.246154,...,111.053462,17.692308,475.523077,17.169231,23.110231,6.204462,17.382615,2009.092308,1.922308e+05,5.212231e+05
std,37.671829,0.576627,3305.646757,142.676855,3582.205625,25.898440,111.205070,26.751749,0.466466,615.226335,...,35.928907,23.828146,558.314049,21.816763,20.802057,4.941531,15.273422,1.377821,1.530973e+05,4.068074e+05
min,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,2008.000000,2.000000e+04,2.000000e+04
25%,33.250000,2.000000,25.500000,0.000000,73.250000,65.650000,0.000000,0.000000,0.000000,39.000000,...,98.237500,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,2008.000000,1.000000e+05,2.250000e+05
50%,65.500000,2.000000,542.500000,7.000000,835.000000,78.225000,18.500000,36.600000,0.000000,172.000000,...,118.510000,6.000000,297.000000,8.500000,24.785000,7.380000,19.935000,2008.000000,2.000000e+05,4.375000e+05
75%,97.750000,2.000000,3002.250000,47.500000,3523.500000,86.790000,106.000000,45.325000,1.000000,925.250000,...,129.102500,29.750000,689.250000,23.750000,35.580000,8.247500,26.212500,2011.000000,2.250000e+05,7.000000e+05
max,130.000000,3.000000,15470.000000,800.000000,18426.000000,116.660000,534.000000,150.000000,1.000000,2254.000000,...,235.490000,129.000000,1975.000000,83.000000,126.300000,38.110000,100.200000,2011.000000,1.350000e+06,1.800000e+06

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 130 entries, 0 to 129
Data columns (total 26 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sl.NO.         130 non-null    int64
 1   PLAYER NAME    130 non-null    object
 2   AGE            130 non-null    int64
 3   COUNTRY        130 non-null    object
 4   TEAM           130 non-null    object
 5   PLAYING ROLE   130 non-null    object
 6   T-RUNS         130 non-null    int64
 7   T-WKTS         130 non-null    int64
 8   ODI-RUNS-S     130 non-null    int64
 9   ODI-SR-B       130 non-null    float64
 10  ODI-WKTS       130 non-null    int64
 11  ODI-SR-BL      130 non-null    float64
 12  CAPTAINCY EXP  130 non-null    int64
 13  RUNS-S         130 non-null    int64
 14  HS             130 non-null    int64
 15  AVE            130 non-null    float64
 16  SR-B           130 non-null    float64
 17  SIXERS         130 non-null    int64
 18  RUNS-C         130 non-null    int64
 19  WKTS           130 non-null    int64
 20  AVE-BL         130 non-null    float64
 21  ECON           130 non-null    float64
 22  SR-BL          130 non-null    float64
 23  AUCTION YEAR   130 non-null    int64
 24  BASE PRICE     130 non-null    int64
 25  SOLD PRICE     130 non-null    int64
dtypes: float64(7), int64(15), object(4)
memory usage: 26.5+ KB

### Question 5

#### Indexing

In [28]:
df.loc[18]

Sl.NO.                   19
PLAYER NAME      Dravid, RS
AGE                       3
COUNTRY                 IND
TEAM                   RCB+
PLAYING ROLE        Batsman
T-RUNS                13288
T-WKTS                    1
ODI-RUNS-S            10889
ODI-SR-B              71.24
ODI-WKTS                  4
ODI-SR-BL              46.5
CAPTAINCY EXP             1
RUNS-S                 1703
HS                       75
AVE                   27.92
SR-B                 116.88
SIXERS                   23
RUNS-C                    0
WKTS                      0
AVE-BL                  0.0
ECON                    0.0
SR-BL                   0.0
AUCTION YEAR           2011
BASE PRICE           400000
SOLD PRICE           500000
Name: 18, dtype: object

In [30]:
df.loc[19]

Sl.NO.                    20
PLAYER NAME      Duminy, J-P
AGE                        2
COUNTRY                   SA
TEAM                     MI+
PLAYING ROLE         Batsman
T-RUNS                   654
T-WKTS                    11
ODI-RUNS-S              2536
ODI-SR-B                84.0
ODI-WKTS                  25
ODI-SR-BL               47.6
CAPTAINCY EXP              0
RUNS-S                   978
HS                        74
AVE                    36.22
SR-B                  119.27
SIXERS                    35
RUNS-C                   377
WKTS                      10
AVE-BL                  37.7
ECON                    7.11
SR-BL                   31.8
AUCTION YEAR            2009
BASE PRICE            300000
SOLD PRICE            300000
Name: 19, dtype: object

In [32]:
df.loc[17]

Sl.NO.                  18
PLAYER NAME      Dinda, AB
AGE                      2
COUNTRY                IND
TEAM                  KKR+
PLAYING ROLE        Bowler
T-RUNS                   0
T-WKTS                   0
ODI-RUNS-S              18
ODI-SR-B              60.0
ODI-WKTS                 5
ODI-SR-BL             61.4
CAPTAINCY EXP            0
RUNS-S                   6
HS                       2
AVE                    1.0
SR-B                 33.33
SIXERS                   0
RUNS-C                 926
WKTS                    36
AVE-BL               25.72
ECON                  7.29
SR-BL                21.19
AUCTION YEAR          2011
BASE PRICE          100000
SOLD PRICE          375000
Name: 17, dtype: object

#### Slicing

In [35]:
df.iloc[4:17,6]

4       63
5        0
6       51
7       54
8       83
9     5515
10    2200
11    9918
12       5
13    5457
14       0
15    3509
16    4722
Name: T-RUNS, dtype: int64

In [37]:
df.iloc[4:17,4]

4      CSK
5      CSK
6     CSK+
7      CSK
8       RR
9     RCB+
10     MI+
11     RCB
12    KXIP
13     DD+
14     MI+
15     CSK
16     DD+
Name: TEAM, dtype: object

### Question 6

In [40]:
df["PLAYER NAME"]

0       Abdulla, YA
1      Abdur Razzak
2       Agarkar, AB
3         Ashwin, R
4      Badrinath, S
           ...
125       Yadav, AS
126     Younis Khan
127    Yuvraj Singh
128     Zaheer Khan
129      Zoysa, DNT
Name: PLAYER NAME, Length: 130, dtype: object

### Question 7

In [79]:
print(df["COUNTRY"].unique())

['SA' 'BAN' 'IND' 'AUS' 'WI' 'SL' 'NZ' 'ENG' 'PAK' 'ZIM']

### Question 8

In [46]:
cross_tab=pd.crosstab(df["AGE"],df["PLAYING ROLE"])
cross_tab

PLAYING ROLE  Allrounder  Batsman  Bowler  W. Keeper
AGE
1                      4        5       7          0
2                     25       21      29         11
3                      6       13       8          1

### Quesion 9

In [81]:
sorted_df=df["SOLD PRICE"].sort_values(ascending=False)
print (sorted_df)

93     1800000
127    1800000
50     1800000
111    1800000
113    1600000
        ...
34       50000
5        50000
0        50000
46       24000
73       20000
Name: SOLD PRICE, Length: 130, dtype: int64

In [87]:
df.loc[:,["PLAYER NAME","SOLD PRICE"]].sort_values(by='SOLD PRICE',ascending=True)

       PLAYER NAME  SOLD PRICE
73      Noffke, AA       20000
46     Kamran Khan       24000
0      Abdulla, YA       50000
1     Abdur Razzak       50000
118  Van der Merwe       50000
..             ...         ...
113     Tiwary, SS     1600000
111  Tendulkar, SR     1800000
50        Kohli, V     1800000
93       Sehwag, V     1800000
127   Yuvraj Singh     1800000

[130 rows x 2 columns]

### Question 10

In [62]:
df['PREMIUM']=df['SOLD PRICE']-df['BASE PRICE']
sorted_df=df['PREMIUM'].sort_values()
print (sorted_df)

0            0
40           0
45           0
49           0
58           0
        ...
93     1400000
127    1400000
111    1400000
113    1500000
50     1650000
Name: PREMIUM, Length: 130, dtype: int64

#### MAXIMUM PREMIUM

In [75]:
max_premium_player = df.loc[df['PREMIUM'].idxmax()]
print(max_premium_player)

Sl.NO.                 51
PLAYER NAME      Kohli, V
AGE                     1
COUNTRY               IND
TEAM                  RCB
PLAYING ROLE      Batsman
T-RUNS                491
T-WKTS                  0
ODI-RUNS-S           3590
ODI-SR-B            86.31
ODI-WKTS                2
ODI-SR-BL           137.0
CAPTAINCY EXP           1
RUNS-S               1639
HS                     73
AVE                 28.26
SR-B               119.29
SIXERS                 49
RUNS-C                345
WKTS                    4
AVE-BL              86.25
ECON                 8.84
SR-BL                58.5
AUCTION YEAR         2011
BASE PRICE         150000
SOLD PRICE        1800000
PRESIUM           1650000
PREMIUM           1650000
Name: 50, dtype: object

In [95]:
#df['PREMIUM']=df['SOLD PRICE']-df['BASE PRICE']
max=df['PREMIUM'].max()
df.loc[df['PREMIUM']==max,['PLAYER NAME','PREMIUM']]

   PLAYER NAME  PREMIUM
50    Kohli, V  1650000

### Question 11

In [110]:
top_10=df.sort_values(by=['PREMIUM'],ascending=False).head(10)
print(top_10[['PLAYER NAME','PREMIUM']])

       PLAYER NAME  PREMIUM
50        Kohli, V  1650000
113     Tiwary, SS  1500000
127   Yuvraj Singh  1400000
111  Tendulkar, SR  1400000
93       Sehwag, V  1400000
108     Symonds, A  1100000
15       Dhoni, MS  1100000
39      Jadeja, RA   850000
95       Sharma, I   800000
3        Ashwin, R   750000

### Question 12

In [115]:
age_groups=df.groupby('AGE')['SOLD PRICE'].mean()
for x,y in age_groups.items():
    print(f"Age{x}=Average Sold Price :{y}")

Age1=Average Sold Price :720250.0
Age2=Average Sold Price :484534.88372093026
Age3=Average Sold Price :520178.5714285714

### Question 13

In [120]:
age_playing_role_groups=df.groupby(['AGE','PLAYING ROLE'])['SOLD PRICE'].mean()
for (age, playing_role),avg_sold_price in age_playing_role_groups.items():
    print(f"Age{age}=Average Sold Price :{avg_sold_price},Playing Role:{playing_role}")

Age1=Average Sold Price :587500.0,Playing Role:Allrounder
Age1=Average Sold Price :1110000.0,Playing Role:Batsman
Age1=Average Sold Price :517714.28571428574,Playing Role:Bowler
Age2=Average Sold Price :449400.0,Playing Role:Allrounder
Age2=Average Sold Price :654761.9047619047,Playing Role:Batsman
Age2=Average Sold Price :397931.0344827586,Playing Role:Bowler
Age2=Average Sold Price :467727.2727272727,Playing Role:W. Keeper
Age3=Average Sold Price :766666.6666666666,Playing Role:Allrounder
Age3=Average Sold Price :457692.3076923077,Playing Role:Batsman
Age3=Average Sold Price :414375.0,Playing Role:Bowler
Age3=Average Sold Price :700000.0,Playing Role:W. Keeper